shakilapr/etrike/mtr-stm32/test/test_mtr_full_suite.cpp
    mtr::RelayController relays;

    // 1. Initial State before and after init()
    relays.init();
    // After init, all relay pins (kRelayRevPin, kRelayDrivePin, kRelayIgnitionPin) must be SET (OFF)
    ASSERT_EQ(relays.state(), mtr::RelayController::State::Off);
    ASSERT_EQ(relays.current_gear(), can::Gear::N);
    ASSERT_FALSE(relays.is_ignition_on());

    // Active-low check: GPIO_PIN_SET means relay is DE-ENERGIZED (OFF)
    // GPIOA pin 0 (Rev), pin 2 (Drive), pin 4 (Ignition) should all have bits set
    uint16_t all_relay_mask = mtr::kRelayRevPin | mtr::kRelayDrivePin | mtr::kRelayIgnitionPin;
    ASSERT_EQ(hal_mock::g_gpio_a_pins & all_relay_mask, all_relay_mask);

    // 2. Set to Drive (Gear::D, ignition_on = true)
    relays.set_gear(can::Gear::D, true);
    ASSERT_EQ(relays.state(), mtr::RelayController::State::Drive);
    ASSERT_EQ(relays.current_gear(), can::Gear::D);
    ASSERT_TRUE(relays.is_ignition_on());

    // Check individual pin levels:
    // Drive pin (PA2) = RESET (0), Ignition pin (PA4) = RESET (0), Reverse pin (PA0) = SET (1)
    bool drive_pin_on = (hal_mock::g_gpio_a_pins & mtr::kRelayDrivePin) == 0;
    bool rev_pin_on   = (hal_mock::g_gpio_a_pins & mtr::kRelayRevPin) == 0;
    bool ign_pin_on   = (hal_mock::g_gpio_a_pins & mtr::kRelayIgnitionPin) == 0;

    ASSERT_TRUE(drive_pin_on);
    ASSERT_FALSE(rev_pin_on);
    ASSERT_TRUE(ign_pin_on);

    // HARD CRITICAL SAFETY CHECK: Drive and Reverse must NEVER be ON at the same time
    ASSERT_FALSE(drive_pin_on && rev_pin_on);

    // 3. Set to Reverse (Gear::R, ignition_on = true)
    relays.set_gear(can::Gear::R, true);
    ASSERT_EQ(relays.state(), mtr::RelayController::State::Reverse);
    ASSERT_EQ(relays.current_gear(), can::Gear::R);
    ASSERT_TRUE(relays.is_ignition_on());

    drive_pin_on = (hal_mock::g_gpio_a_pins & mtr::kRelayDrivePin) == 0;
    rev_pin_on   = (hal_mock::g_gpio_a_pins & mtr::kRelayRevPin) == 0;
    ign_pin_on   = (hal_mock::g_gpio_a_pins & mtr::kRelayIgnitionPin) == 0;

    ASSERT_FALSE(drive_pin_on);
    ASSERT_TRUE(rev_pin_on);
    ASSERT_TRUE(ign_pin_on);
    ASSERT_FALSE(drive_pin_on && rev_pin_on); // Mutual exclusion verified!

    // 4. Set to Park / Neutral (Gear::N, ignition_on = true)
    relays.set_gear(can::Gear::N, true);
    ASSERT_EQ(relays.state(), mtr::RelayController::State::Park);
    ASSERT_EQ(relays.current_gear(), can::Gear::N);
    ASSERT_TRUE(relays.is_ignition_on());

    drive_pin_on = (hal_mock::g_gpio_a_pins & mtr::kRelayDrivePin) == 0;
    rev_pin_on   = (hal_mock::g_gpio_a_pins & mtr::kRelayRevPin) == 0;
    ign_pin_on   = (hal_mock::g_gpio_a_pins & mtr::kRelayIgnitionPin) == 0;

    ASSERT_FALSE(drive_pin_on);
    ASSERT_FALSE(rev_pin_on);
    ASSERT_TRUE(ign_pin_on);

    // 5. Gear D with Ignition OFF -> MUST force State::Off
    relays.set_gear(can::Gear::D, false);
    ASSERT_EQ(relays.state(), mtr::RelayController::State::Off);
    ASSERT_FALSE(relays.is_ignition_on());
    ASSERT_EQ(hal_mock::g_gpio_a_pins & all_relay_mask, all_relay_mask);

    // 6. Status LED Toggles on state changes
    uint32_t toggles_before = hal_mock::g_led_toggle_count;
    relays.set_state(mtr::RelayController::State::Drive);
    ASSERT_EQ(hal_mock::g_led_toggle_count, toggles_before + 1);

    // Re-asserting same state must NOT toggle LED
    relays.set_state(mtr::RelayController::State::Drive);
    ASSERT_EQ(hal_mock::g_led_toggle_count, toggles_before + 1);
}

// ═══════════════════════════════════════════════════════════════════════
// 2. Software I2C & MCP4725 DAC Controller
// ═══════════════════════════════════════════════════════════════════════

void test_dac_controller_software_i2c_and_clamps() {
    std::printf("[TEST GROUP] MCP4725 Software I2C & Voltage Clamping...\n");
    hal_mock::reset();

    mtr::DacController dac;
    dac.init();
    ASSERT_EQ(dac.current_code(), 0);

    // 1. Standard active write with default address 0x60 (0xC0)
    hal_mock::g_i2c_target_addr = 0x60 << 1; // 0xC0
    dac.set_throttle(1000, true);
    ASSERT_EQ(dac.current_code(), 1000);
    ASSERT_EQ(hal_mock::g_last_dac_written, 1000);

    // 2. Voltage Safety Window Clamping:
    // Minimum active code is 655 (~0.8V)
    dac.set_throttle(100, true);
    ASSERT_EQ(dac.current_code(), mtr::kDacMinCode); // Clamped to 655
    ASSERT_EQ(hal_mock::g_last_dac_written, mtr::kDacMinCode);

    dac.set_throttle(654, true);
    ASSERT_EQ(dac.current_code(), mtr::kDacMinCode);

    dac.set_throttle(655, true);
    ASSERT_EQ(dac.current_code(), 655);

    // Maximum active code is 1966 (~2.4V)
    dac.set_throttle(1966, true);
    ASSERT_EQ(dac.current_code(), mtr::kDacMaxCode);

    dac.set_throttle(2500, true);
    ASSERT_EQ(dac.current_code(), mtr::kDacMaxCode); // Clamped to 1966
    ASSERT_EQ(hal_mock::g_last_dac_written, mtr::kDacMaxCode);

    dac.set_throttle(5000, true);
    ASSERT_EQ(dac.current_code(), mtr::kDacMaxCode); // Out of 12-bit range clamped to 1966

    // 3. Zero / Disable Enforcement:
    // code = 0 -> outputs 0.0V
    dac.set_throttle(0, true);
    ASSERT_EQ(dac.current_code(), 0);
    ASSERT_EQ(hal_mock::g_last_dac_written, 0);

    // enabled = false -> outputs 0.0V regardless of requested code
    dac.set_throttle(1500, false);
    ASSERT_EQ(dac.current_code(), 0);
    ASSERT_EQ(hal_mock::g_last_dac_written, 0);

    // force_zero() -> outputs 0.0V
    dac.set_throttle(1200, true);
    ASSERT_EQ(dac.current_code(), 1200);
    dac.force_zero();
    ASSERT_EQ(dac.current_code(), 0);
    ASSERT_EQ(hal_mock::g_last_dac_written, 0);

    // 4. Multi-Address Probing (0x60, 0x61, 0x62)
    // Switch target address to candidate 0x61 (0xC2)
    hal_mock::g_i2c_target_addr = 0x61 << 1;
    // Current cache holds 0x60 -> first probe will NACK and invalidate cache, then successfully probe 0x61!
    dac.set_throttle(1400, true);
    ASSERT_EQ(dac.current_code(), 1400);
    ASSERT_EQ(hal_mock::g_last_dac_written, 1400);
}

// ═══════════════════════════════════════════════════════════════════════
// 3. Motor Manager: ESTOP & Recovery Transitions
// ═══════════════════════════════════════════════════════════════════════

void test_motor_manager_estop_and_recovery() {
    std::printf("[TEST GROUP] Motor Manager: ESTOP & Recovery...\n");
    hal_mock::reset();

