shakilapr/etrike/mtr-stm32/test/test_mtr_full_suite.cpp
    mtr::RelayController relays;
    mtr::DacController dac;
    mtr::MotorManager mgr(relays, dac);

    mgr.init();
    ASSERT_FALSE(mgr.is_estop_active());

    // 1. Establish normal driving state in Drive
    // Authority from SYS: mode (0x110) + power (0x113), then drive command.
    send_mode(mgr, can::Mode::Manual, 100);
    send_power(mgr, true, 100);

    // Drive command 2000 mm/s in Drive (0x204)
    can::gen::RtDriveCmd drv{2000, static_cast<uint8_t>(can::Gear::D)};
    can::Frame drv_fr;
    can::gen::encode_rt_drive_cmd(drv, drv_fr);
    mgr.handle_frame(drv_fr, 100);

    // Establish the SYS_SAFETY_STS (0x011) stream with estop_active=0 before driving.
    send_safety(mgr, false, 100);

    mgr.tick(100);
    ASSERT_EQ(relays.state(), mtr::RelayController::State::Drive);
    ASSERT_TRUE(dac.current_code() > 0);

    // 2. Trigger ESTOP via 0x001 SAFETY_ESTOP
    can::Frame estop_fr;
    estop_fr.id = can::kIdSafetyEstop; // 0x001
    estop_fr.dlc = 0;
    mgr.handle_frame(estop_fr, 105);

    // SYS keeps reporting the latched E-stop on 0x011 while ESTOP is active.
    send_safety(mgr, true, 108);

    ASSERT_TRUE(mgr.is_estop_active());
    mgr.tick(110);

    // Relays forced to Off, DAC forced to 0V
    ASSERT_EQ(relays.state(), mtr::RelayController::State::Off);
    ASSERT_EQ(dac.current_code(), 0);

    // Gap #15 Redundant ESTOP ACK check in 0x206 MTR_MOTOR_FBK
    can::Frame fbk_fr = mgr.build_motor_feedback_frame();
    can::gen::MtrMotorFbk fbk{};
    can::gen::decode_mtr_motor_fbk(fbk_fr.view(), fbk);
    ASSERT_TRUE((fbk.fault_flags & shared::kMtrFaultEstopActive) != 0);
    ASSERT_TRUE((fbk.fault_flags & shared::kMtrFaultStartupReady) != 0);

    // 3. Recovery via SYS_SAFETY_STS (0x011) — the ONLY path that clears the
    //    latched E-stop. The 0x110 mode command no longer carries ESTOP.
    //    Two consecutive fresh, advancing frames with estop_active == 0 are
    //    required for an authorized clear (asymmetric assert/clear).
    // Two zero frames (baseline + advancing) after the latched ESTOP form the
    // authorized clear.
    send_safety(mgr, false, 110);
    ASSERT_FALSE(mgr.is_estop_active());

    // After an authorized clear the authority streams are invalidated and a REARM
    // sequence is required before propulsion is re-enabled. Re-establish mode and
    // observe a fresh 0x113 OFF->ON edge.
    send_mode(mgr, can::Mode::Manual, 115); // re-establish mode authority (fresh 0x110)
    send_power(mgr, false, 115);            // REARM off phase
    send_power(mgr, true, 115);             // REARM on edge -> rearm_observed

    // Now tick again with valid drive frame -> Motor resumes!
    mgr.handle_frame(drv_fr, 120);
    mgr.tick(120);
    ASSERT_EQ(relays.state(), mtr::RelayController::State::Drive);
    ASSERT_TRUE(dac.current_code() > 0);
}

// ═══════════════════════════════════════════════════════════════════════
// 4. Motor Manager: Direction Shift Arc-Protection Dwell (50 ms)
// ═══════════════════════════════════════════════════════════════════════

void test_motor_manager_direction_shift_dwell() {
    std::printf("[TEST GROUP] Direction Shift Arc-Protection Dwell (50 ms)...\n");
    hal_mock::reset();

    mtr::RelayController relays;
    mtr::DacController dac;
    mtr::MotorManager mgr(relays, dac);
    mgr.init();

    // Authority from SYS: mode (0x110) + power (0x113)
    send_mode(mgr, can::Mode::Manual, 100);
    send_power(mgr, true, 100);

    // 1. Cruising in Drive (D) at 1500 mm/s
    can::gen::RtDriveCmd drv_cmd{1500, static_cast<uint8_t>(can::Gear::D)};
    can::Frame drv_fr;
    can::gen::encode_rt_drive_cmd(drv_cmd, drv_fr);
    mgr.handle_frame(drv_fr, 100);
    send_safety(mgr, false, 100); // establish 0x011 stream (estop_active=0)
    mgr.tick(100);

    ASSERT_EQ(relays.state(), mtr::RelayController::State::Drive);
    ASSERT_TRUE(dac.current_code() > 0);

    // 2. Immediate reversal requested: shift to Reverse (R) at t = 200 ms
    can::gen::RtDriveCmd rev_cmd{300, static_cast<uint8_t>(can::Gear::R)};
    can::Frame rev_fr;
    can::gen::encode_rt_drive_cmd(rev_cmd, rev_fr);
    mgr.handle_frame(rev_fr, 200);

    // First tick at t = 200 ms (direction shift detected):
    mgr.tick(200);

    // Arc-protection dwell MUST immediately drop DAC to 0 and shift relays to Neutral (Park)
    ASSERT_EQ(relays.state(), mtr::RelayController::State::Park);
    ASSERT_EQ(dac.current_code(), 0);

    // 3. Check during dwell: at t = 230 ms (30 ms elapsed < 50 ms dwell)
    mgr.tick(230);
    ASSERT_EQ(relays.state(), mtr::RelayController::State::Park); // Still in neutral!
    ASSERT_EQ(dac.current_code(), 0);

    // 4. Check at expiration of dwell: at t = 250 ms (50 ms elapsed = kShiftDwellMs)
    mgr.tick(250);
    // Dwell complete! Reverse relay now energizes and DAC activates!
    ASSERT_EQ(relays.state(), mtr::RelayController::State::Reverse);
    ASSERT_TRUE(dac.current_code() > 0);

    // 5. Shift back from Reverse (R) to Drive (D) at t = 300 ms
    mgr.handle_frame(drv_fr, 300);
    mgr.tick(300);

    // Must immediately enter neutral dwell with DAC 0
    ASSERT_EQ(relays.state(), mtr::RelayController::State::Park);
    ASSERT_EQ(dac.current_code(), 0);

    // At t = 325 ms (mid-dwell)
    mgr.tick(325);
    ASSERT_EQ(relays.state(), mtr::RelayController::State::Park);
    ASSERT_EQ(dac.current_code(), 0);

    // At t = 350 ms (dwell finished)
    mgr.tick(350);
    ASSERT_EQ(relays.state(), mtr::RelayController::State::Drive);
    ASSERT_TRUE(dac.current_code() > 0);
}

// ═══════════════════════════════════════════════════════════════════════
// 5. Motor Manager: Comms Watchdog Timeout (500 ms)
// ═══════════════════════════════════════════════════════════════════════

void test_motor_manager_watchdog_timeout() {
    std::printf("[TEST GROUP] Comms Watchdog Timeout (500 ms)...\n");
    hal_mock::reset();

    mtr::RelayController relays;
    mtr::DacController dac;
    mtr::MotorManager mgr(relays, dac);
    mgr.init();

    // Authority from SYS: mode (0x110) + power (0x113)
    send_mode(mgr, can::Mode::Manual, 1000);
    send_power(mgr, true, 1000);

    // Drive command at t = 1000 ms
    can::gen::RtDriveCmd drv{2000, static_cast<uint8_t>(can::Gear::D)};
    can::Frame drv_fr;
    can::gen::encode_rt_drive_cmd(drv, drv_fr);
    mgr.handle_frame(drv_fr, 1000);
    send_safety(mgr, false, 1000); // establish 0x011 stream (estop_active=0)
    mgr.tick(1000);

    ASSERT_EQ(relays.state(), mtr::RelayController::State::Drive);
    ASSERT_TRUE(dac.current_code() > 0);

    // Elapsed 500 ms (t = 1500 ms) without new frames -> exactly at threshold, not timed out
    mgr.tick(1500);
    ASSERT_EQ(relays.state(), mtr::RelayController::State::Drive);

    // Elapsed 501 ms (t = 1501 ms) -> TIMEOUT!
    mgr.tick(1501);
    ASSERT_EQ(relays.state(), mtr::RelayController::State::Off);
    ASSERT_EQ(dac.current_code(), 0);

    // At t = 1800 ms (still silent)
    mgr.tick(1800);
    ASSERT_EQ(relays.state(), mtr::RelayController::State::Off);
    ASSERT_EQ(dac.current_code(), 0);

    // Frame resumes at t = 2000 ms -> Watchdog recovers automatically.
    // Re-establish all authority streams (mode/power/safety) after the silence.
    send_mode(mgr, can::Mode::Manual, 2000);
    send_power(mgr, true, 2000);
    send_safety(mgr, false, 2000);
    mgr.handle_frame(drv_fr, 2000);
    mgr.tick(2000);
    ASSERT_EQ(relays.state(), mtr::RelayController::State::Drive);
    ASSERT_TRUE(dac.current_code() > 0);
}

