shakilapr/etrike/mtr-stm32/test/test_mtr_full_suite.cpp
    // Latch ESTOP.
    can::Frame estop_fr;
    estop_fr.id = can::kIdSafetyEstop;
    estop_fr.dlc = 0;
    mgr.handle_frame(estop_fr, 105);
    send_safety(mgr, true, 108);
    ASSERT_TRUE(mgr.is_estop_active());

    // Authorized clear via two zero 0x011 frames.
    send_safety(mgr, false, 110);
    ASSERT_FALSE(mgr.is_estop_active());

    // Cleared, but propulsion must remain OFF until REARM is observed.
    mgr.handle_frame(drv_fr, 115);
    mgr.tick(115);
    ASSERT_EQ(relays.state(), mtr::RelayController::State::Off);
    ASSERT_EQ(dac.current_code(), 0);

    // Fresh REARM: 0x110 mode + 0x113 OFF then ON edge.
    send_mode(mgr, can::Mode::Manual, 120);
    send_power(mgr, false, 120);
    send_power(mgr, true, 120);
    mgr.handle_frame(drv_fr, 120);
    mgr.tick(120);
    ASSERT_EQ(relays.state(), mtr::RelayController::State::Drive);
    ASSERT_TRUE(dac.current_code() > 0);
}

// ═══════════════════════════════════════════════════════════════════════
// 8. FDCAN Driver: FIFO 0 Ringbuffer Mechanics
// ═══════════════════════════════════════════════════════════════════════

void test_fdcan_driver_ringbuffer() {
    std::printf("[TEST GROUP] FDCAN Driver: Ringbuffer & Filter Mechanics...\n");
    fdcan_mock::reset();

    mtr::CanDriver driver(hfdcan1);
    ASSERT_TRUE(driver.init());

    // Test FIFO push and poll
    can::Frame fr_out;
    ASSERT_FALSE(driver.poll_rx(fr_out)); // Empty ringbuffer

    // Inject 3 frames via ISR callback
    for (uint32_t id : {0x001u, 0x110u, 0x204u}) {
        fdcan_mock::MockMsg m{};
        m.id = id;
        m.ext = false;
        m.dlc = 8;
        m.data[0] = static_cast<uint8_t>(id & 0xFF);
        fdcan_mock::g_rx_queue.push_back(m);
    }

    driver.handle_rx_fifo0_isr();

    // Verify FIFO ordering: 0x001, 0x110, 0x204
    ASSERT_TRUE(driver.poll_rx(fr_out));
    ASSERT_EQ(fr_out.id, 0x001u);

    ASSERT_TRUE(driver.poll_rx(fr_out));
    ASSERT_EQ(fr_out.id, 0x110u);

    ASSERT_TRUE(driver.poll_rx(fr_out));
    ASSERT_EQ(fr_out.id, 0x204u);

    ASSERT_FALSE(driver.poll_rx(fr_out)); // Exhausted

    // Test Ringbuffer Overflow (size is 32)
    // Push 35 frames
    for (int i = 0; i < 35; ++i) {
        fdcan_mock::MockMsg m{};
        m.id = 0x204u;
        m.ext = false;
        m.dlc = 1;
        fdcan_mock::g_rx_queue.push_back(m);
    }
    driver.handle_rx_fifo0_isr();

    // Should detect overflow and count drops
    ASSERT_TRUE(driver.rx_overflow() > 0);

    // Test Transmit path
    can::Frame tx_frame(0x206, false, 4);
    tx_frame.data[0] = 0xAA;
    ASSERT_TRUE(driver.send(tx_frame));
    ASSERT_EQ(driver.tx_count(), 1u);
    ASSERT_EQ(fdcan_mock::g_tx_msgs.size(), 1u);
    ASSERT_EQ(fdcan_mock::g_tx_msgs[0].id, 0x206u);
}

} // namespace

// ═══════════════════════════════════════════════════════════════════════
// Main Entry Point
// ═══════════════════════════════════════════════════════════════════════

int main() {
    std::printf("\n========================================================\n");
    std::printf("  MTR-STM32 COMPLETE TEST SUITE (FULL SUBSYSTEM COVERAGE)\n");
    std::printf("========================================================\n\n");

    test_relay_controller_mutual_exclusion();
    test_dac_controller_software_i2c_and_clamps();
    test_motor_manager_estop_and_recovery();
    test_motor_manager_direction_shift_dwell();
    test_motor_manager_watchdog_timeout();
    test_motor_manager_dac_curves();
    test_motor_manager_dac_golden_vectors();
    test_motor_manager_mode_cmd_does_not_clear_estop();
    test_motor_manager_asymmetric_clear_requires_two_frames();
    test_motor_manager_safety_stream_freshness_fail_safe();
    test_motor_manager_safety_crc_corruption_fail_safe();
    test_motor_manager_recovery_requires_rearm();
    test_fdcan_driver_ringbuffer();

    std::printf("\n--------------------------------------------------------\n");
    std::printf("MTR-STM32 Total Assertions: %d | Failures: %d\n", g_tests_run, g_tests_failed);
    if (g_tests_failed == 0) {
        std::printf(">>> ALL MTR-STM32 TESTS PASSED! <<<\n\n");
        return 0;
    }
    std::printf(">>> SOME MTR-STM32 TESTS FAILED! <<<\n\n");
    return 1;
}
